## Staging
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 2 to add, 2 to change, 2 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                        RESOURCE                         |
|----------|---------------------------------------------------------|
| update   | `module.celery_worker_ecs.aws_ecs_service.this`         |
|          | `module.superset_ecs.aws_ecs_service.this`              |
| recreate | `module.celery_worker_ecs.aws_ecs_task_definition.this` |
|          | `module.superset_ecs.aws_ecs_task_definition.this`      |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.celery_worker_ecs.data.aws_ecs_task_definition.this_latest will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ecs_task_definition" "this_latest" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = (known after apply)
      + enable_fault_injection   = (known after apply)
      + ephemeral_storage        = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = (known after apply)
      + id                       = (known after apply)
      + ipc_mode                 = (known after apply)
      + memory                   = (known after apply)
      + network_mode             = (known after apply)
      + pid_mode                 = (known after apply)
      + placement_constraints    = (known after apply)
      + proxy_configuration      = (known after apply)
      + region                   = (known after apply)
      + requires_compatibilities = (known after apply)
      + revision                 = (known after apply)
      + runtime_platform         = (known after apply)
      + status                   = (known after apply)
      + task_definition          = "celery-worker"
      + task_role_arn            = (known after apply)
      + volume                   = (known after apply)
    }

  # module.celery_worker_ecs.aws_ecs_service.this will be updated in-place
  ~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ca-central-1:257394494478:service/superset/celery-worker"
        name                               = "celery-worker"
        tags                               = {
            "CostCentre" = "cds-superset-staging"
            "Terraform"  = "true"
        }
      ~ task_definition                    = "celery-worker:81" -> (known after apply)
        # (17 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.celery_worker_ecs.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:257394494478:task-definition/celery-worker:76" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ca-central-1:257394494478:task-definition/celery-worker" -> (known after apply)
      ~ container_definitions    = jsonencode( # whitespace changes
            [
                {
                    command                = [
                        "/app/docker/docker-bootstrap.sh",
                        "worker",
                    ]
                    environment            = [
                        {
                            name  = "CACHE_WARMUP_EXECUTORS"
                            value = "cache-warmer"
                        },
                        {
                            name  = "FLASK_DEBUG"
                            value = "true"
                        },
                        {
                            name  = "GUNICORN_KEEPALIVE"
                            value = "120"
                        },
                        {
                            name  = "REDIS_HOST"
                            value = "superset-cache-staging.wv1cbb.ng.0001.cac1.cache.amazonaws.com"
                        },
                        {
                            name  = "REDIS_PORT"
                            value = "6379"
                        },
                        {
                            name  = "SMTP_HOST"
                            value = "email-smtp.ca-central-1.amazonaws.com"
                        },
                        {
                            name  = "SMTP_MAIL_FROM"
                            value = "no-reply@superset.cdssandbox.xyz"
                        },
                        {
                            name  = "SUPERSET_DATABASE_DB"
                            value = "superset"
                        },
                        {
                            name  = "WEBDRIVER_BASEURL"
                            value = "http://superset.superset.ecs.local:8088"
                        },
                        {
                            name  = "WEBDRIVER_BASEURL_USER_FRIENDLY"
                            value = "https://superset.cdssandbox.xyz"
                        },
                    ]
                    essential              = true
                    image                  = "257394494478.dkr.ecr.ca-central-1.amazonaws.com/superset:latest"
                    linuxParameters        = {
                        capabilities = {
                            add  = []
                            drop = [
                                "ALL",
                            ]
                        }
                    }
                    logConfiguration       = {
                        logDriver = "awslogs"
                        options   = {
                            awslogs-group         = "/aws/ecs/superset/celery-worker"
                            awslogs-region        = "ca-central-1"
                            awslogs-stream-prefix = "task"
                        }
                    }
                    mountPoints            = []
                    name                   = "celery-worker"
                    portMappings           = [
                        {
                            containerPort = 8088
                            hostPort      = 8088
                            protocol      = "tcp"
                        },
                    ]
                    readonlyRootFilesystem = false
                    secrets                = [
                        {
                            name      = "SLACK_API_TOKEN"
                            valueFrom = "arn:aws:ssm:ca-central-1:257394494478:parameter/slack_api_token"
                        },
                        {
                            name      = "SMTP_PASSWORD"
                            valueFrom = "arn:aws:ssm:ca-central-1:257394494478:parameter/smtp_password"
                        },
                        {
                            name      = "SMTP_USER"
                            valueFrom = "arn:aws:ssm:ca-central-1:257394494478:parameter/smtp_user"
                        },
                        {
                            name      = "SUPERSET_DATABASE_HOST"
                            valueFrom = "arn:aws:ssm:ca-central-1:257394494478:parameter/superset_database_host"
                        },
                        {
                            name      = "SUPERSET_DATABASE_PASSWORD"
                            valueFrom = "arn:aws:ssm:ca-central-1:257394494478:parameter/superset_database_password"
                        },
                        {
                            name      = "SUPERSET_DATABASE_USER"
                            valueFrom = "arn:aws:ssm:ca-central-1:257394494478:parameter/superset_database_username"
                        },
                        {
                            name      = "SUPERSET_SECRET_KEY"
                            valueFrom = "arn:aws:ssm:ca-central-1:257394494478:parameter/superset_secret_key"
                        },
                    ]
                    systemControls         = []
                    volumesFrom            = []
                },
            ]
        )
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "celery-worker" -> (known after apply)
      ~ memory                   = "4096" -> "6144" # forces replacement
      ~ revision                 = 76 -> (known after apply)
        tags                     = {
            "CostCentre" = "cds-superset-staging"
            "Terraform"  = "true"
        }
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.superset_ecs.data.aws_ecs_task_definition.this_latest will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ecs_task_definition" "this_latest" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = (known after apply)
      + enable_fault_injection   = (known after apply)
      + ephemeral_storage        = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = (known after apply)
      + id                       = (known after apply)
      + ipc_mode                 = (known after apply)
      + memory                   = (known after apply)
      + network_mode             = (known after apply)
      + pid_mode                 = (known after apply)
      + placement_constraints    = (known after apply)
      + proxy_configuration      = (known after apply)
      + region                   = (known after apply)
      + requires_compatibilities = (known after apply)
      + revision                 = (known after apply)
      + runtime_platform         = (known after apply)
      + status                   = (known after apply)
      + task_definition          = "superset"
      + task_role_arn            = (known after apply)
      + volume                   = (known after apply)
    }

  # module.superset_ecs.aws_ecs_service.this will be updated in-place
  ~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ca-central-1:257394494478:service/superset/superset"
        name                               = "superset"
        tags                               = {
            "CostCentre" = "cds-superset-staging"
            "Terraform"  = "true"
        }
      ~ task_definition                    = "superset:81" -> (known after apply)
        # (17 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.superset_ecs.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:257394494478:task-definition/superset:78" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ca-central-1:257394494478:task-definition/superset" -> (known after apply)
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "superset" -> (known after apply)
      ~ memory                   = "4096" -> "6144" # forces replacement
      ~ revision                 = 78 -> (known after apply)
        tags                     = {
            "CostCentre" = "cds-superset-staging"
            "Terraform"  = "true"
        }
        # (13 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 2 to add, 2 to change, 2 to destroy.

Warning: Deprecated attribute

  on .terraform/modules/athena_access_logs/athena_access_logs/locals.tf line 6, in locals:
   6:   region     = data.aws_region.current.name

The attribute "name" is deprecated. Refer to the provider documentation for
details.

(and 14 more similar warnings elsewhere)

Warning: Argument is deprecated

  with module.athena_bucket.aws_s3_bucket.this,
  on .terraform/modules/athena_bucket/S3/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

server_side_encryption_configuration is deprecated. Use the
aws_s3_bucket_server_side_encryption_configuration resource instead.

(and 8 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_athena_data_catalog.data_lake[\"production\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_athena_data_catalog.data_lake[\"staging\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.ses_bounce_rate_high"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.ses_complaint_rate_high"]
WARN - plan.json - main - Missing Common Tags: ["aws_elasticache_subnet_group.superset_cache"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.superset_send_email"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.superset_waf_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_user.superset_send_email"]
WARN - plan.json - main - Missing Common Tags: ["aws_kinesis_firehose_delivery_stream.superset_waf_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_regex_pattern_set.label_sizerestrictions_body_excluded_paths"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_cloudwatch_log_group.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_iam_policy.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_iam_role.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_lambda_function.sentinel_forwarder"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_ssm_parameter.sentinel_forwarder_auth"]

34 tests, 19 passed, 15 warnings, 0 failures, 0 exceptions

```

</details>
